Revit 2027 API
AnalyticalBusData Methods
The AnalyticalBusData type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from AnalyticalDistributionNodePropertyData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAllAvailableConnectedPhasesOnDownstream |  Get all the available electrical connected phases that this power distributable node can provide to the downstream node.
(Inherited from AnalyticalPowerDistributableNodeData)
GetApparentPerPhaseResults |  Get an ElectricalPerPhaseData which contains each electrical phase's apparent load and apprent current of the power distributable node.
(Inherited from AnalyticalPowerDistributableNodeData)
GetConnectedPhasesOnDownstream |  Get the electrical connected phases of the downstream node.
(Inherited from AnalyticalPowerDistributableNodeData)
GetDemandPerPhaseResults |  Get an ElectricalPerPhaseData which contains each electrical phase's demand load and demand current of the power distributable node.
(Inherited from AnalyticalPowerDistributableNodeData)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetConnectedPhasesOnDownstream |  Set the electrical connected phases of the downstream node.
(Inherited from AnalyticalPowerDistributableNodeData)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
AnalyticalBusData Class
Autodesk.Revit.DB.Electrical Namespace